// Задача № 17. Напишите программу, которая
// принимает на вход координаты точки (X и Y),
// причем X и Y не равны 0 и выдает номер четверти
// плоскости, в которой находится эта точка.

// Console.WriteLine("Введите число ");
// int X = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число ");
// int Y = Convert.ToInt32(Console.ReadLine());

// if(X > 0 && Y > 0)
// {
//    Console.WriteLine("1");
// }
// else if(X < 0 && Y > 0)
// {
//    Console.WriteLine("2");
// }
// else if(X < 0 && Y < 0)
// {
//    Console.WriteLine("3");
// }
// else if(X > 0 && Y < 0)
// {
//    Console.WriteLine("4");
// }
// else
// {
//    Console.WriteLine("Точка лежит на оси");
// }


// Задача 18.
// Напишите программу, которая по заданному 
// номеру четвертиПоказывает диапозон возможных
// координат точек в этой четверти (X и Y).

// Console.WriteLine("Введите число от 1 до 4");
// int number = Convert.ToInt32(Console.ReadLine());

// if(number == 1)
// {
//    Console.WriteLine("X > 0, Y > 0");
// }
// else if(number == 2)
// {
//    Console.WriteLine("X < 0, Y > 0");
// }
// else if(number == 3)
// {
//    Console.WriteLine("X < 0, Y < 0");
// }
// else if(number == 4)
// {
//    Console.WriteLine("X > 0, Y < 0");
// }
// else
// {
//    Console.WriteLine("Введите номер от 1 до 4");
// }


// Console.WriteLine("Введите число от 1 до 4");
// int number = Convert.ToInt32(Console.ReadLine());

// switch(number)
// {
//    case 1:
//    {
//    Console.WriteLine("X > 0, Y > 0");
//    break;
//    }
//    case 2:
//    {
//    Console.WriteLine("X < 0, Y > 0");
//    break;
//    }
//    case 3:
//    {
//    Console.WriteLine("X < 0, Y < 0");
//    break;
//    }
// case 4:
//    {
//    Console.WriteLine("X > 0, Y < 0");
//    break;
//    }
// default:
//    {
//    Console.WriteLine("Введите номер от 1 до 4");
//    break;
//    }
// }


// Console.WriteLine("Введите число X1");
// int X1 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число Y1");
// int Y1 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число X1");
// int X2 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число Y2");
// int Y2 = Convert.ToInt32(Console.ReadLine());

// double number = Math.Sqrt(Math.Pow((X2 - X1), 2) + Math.Pow((Y2-Y1), 2));
// Console.WriteLine(number);


// Console.WriteLine("Введите число ");
// int number = Convert.ToInt32(Console.ReadLine());

// for(int i = 1; i <= number; i++)
// {
//    Console.WriteLine(Math.Pow(i, 2));
// }


